app/controllers/analytics_controller.rb

SELECT "search_summaries".* FROM "search_summaries"
---
  def index
    @summaries_by_ip = SearchSummary.all.group_by(&:ip_address)