app/controllers/search_logs_controller.rb

SELECT "search_sessions".* FROM "search_sessions" WHERE "search_sessions"."ip" = ? AND (started_at > '2025-08-02 14:58:47.359149') ORDER BY "search_sessions"."started_at" DESC LIMIT ?  [["ip", "::1"], ["LIMIT", 1]]
INSERT INTO "search_sessions" ("ip", "started_at", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["ip", "::1"], ["started_at", "2025-08-02 15:00:47.361241"], ["created_at", "2025-08-02 15:00:47.378694"], ["updated_at", "2025-08-02 15:00:47.378694"]]
INSERT INTO "search_queries" ("search_session_id", "query_text", "submitted_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["search_session_id", 178], ["query_text", "H"], ["submitted_at", "2025-08-02 15:00:47.393358"], ["created_at", "2025-08-02 15:00:47.402180"], ["updated_at", "2025-08-02 15:00:47.402180"]]
INSERT INTO "search_sessions" ("ip", "started_at", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["ip", "::1"], ["started_at", "2025-08-01 14:20:43.235677"], ["created_at", "2025-08-01 14:20:43.245763"], ["updated_at", "2025-08-01 14:20:43.245763"]]
---
  def create
    query = params[:query].to_s.strip
    ip = request.remote_ip

    return head :ok if query.blank?

    session = SearchSession.where(ip: ip).where("started_at > ?", 2.minutes.ago).order(started_at: :desc).first
    session ||= SearchSession.create!(ip: ip, started_at: Time.current)

    session.search_queries.create!(
      query_text: query,
      submitted_at: Time.current
    )

SELECT "search_summaries".* FROM "search_summaries" WHERE "search_summaries"."ip_address" = ? ORDER BY "search_summaries"."created_at" DESC LIMIT ?  [["ip_address", "::1"], ["LIMIT", 1]]
UPDATE "search_summaries" SET "query" = ?, "updated_at" = ? WHERE "search_summaries"."id" = ?  [["query", "HI"], ["updated_at", "2025-08-02 15:00:47.876396"], ["id", 128]]
INSERT INTO "search_summaries" ("ip_address", "query", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["ip_address", "::1"], ["query", "H"], ["created_at", "2025-08-02 15:00:47.414650"], ["updated_at", "2025-08-02 15:00:47.414650"]]
---
  def summarize_session(ip, new_query)
    latest_summary = SearchSummary.where(ip_address: ip).order(created_at: :desc).first

    if latest_summary&.query && new_query.include?(latest_summary.query)
      # Replace old summary with the extended one
      latest_summary.update!(query: new_query)
    elsif latest_summary&.query == new_query
      # Avoid duplicate identical queries
      return
    else
      # Create new summary
      SearchSummary.create!(ip_address: ip, query: new_query)